# Analysing Sales by a Pet Product Retailer

PetMind is a retailer of products for pets based in the United States. They sell products that are a mix of luxury items and everyday items. Luxury items include toys; everyday items include food.

The company wants to increase sales by focusing on products that are bought repeatedly, and has contacted me to analyse how repeat purchases impact sales.

The idea and data for this project are from [DataCamp](https://projects.datacamp.com/projects/2194).

## Data

The data is available in the table `pet_supplies`. The dataset contains the sales records in the stores last year. 

| Column Name | Criteria                                                |
|-------------|:---------------------------------------------------------|
|product_id | Nominal. The unique identifier of the product. </br>Missing values are not possible due to the database structure.|
| category | Nominal. The category of the product, one of 6 values (Housing, Food, Toys, Equipment, Medicine, Accessory). </br>Missing values should be replaced with “Unknown”. |
| animal | Nominal. The type of animal the product is for. One of Dog, Cat, Fish, Bird. </br>Missing values should be replaced with “Unknown”. |
| size | Ordinal. The size of animal the product is for. Small, Medium, Large. </br>Missing values should be replaced with “Unknown”.|
| price | Continuous. The price the product is sold at. Can be any positive value, round to 2 decimal places. </br>Missing values should be replaced with the overall median price. |
| sales | Continuous. The value of all sales of the product in the last year. This can be any positive value, rounded to 2 decimal places. </br>Missing values should be replaced with the overall median sales. |
| rating | Discrete. Customer rating of the product from 1 to 10. </br>Missing values should be replaced with 0. |
| repeat_purchase | Nominal. Whether customers repeatedly buy the product (1) or not (0). </br>Missing values should be removed. |

## Exploratory Data Analysis and Data Wrangling
Let's first take a look at the table.

In [1]:
SELECT *
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size  price    sales  rating  repeat_purchase
0           1      Food   Bird   large  51.10  1860.62       7                1
1           2   Housing   Bird  MEDIUM  35.98   963.60       6                0
2           3      Food    Dog  medium  31.23   898.30       5                1
3           4  Medicine    Cat   small  24.95   982.15       6                1
4           5   Housing    Cat   Small  26.18   832.63       7                1

Let's see the number of rows the table has.

In [3]:
SELECT COUNT(*)
FROM pet_supplies;

   count
0   1500

There are 1500 entries.

### The `category` column

_**Criteria:** Nominal. The category of the product, one of 6 values (Housing, Food, Toys, Equipment, Medicine, Accessory). Missing values should be replaced with “Unknown”._

Let's count the number of non-null categories.

In [4]:
SELECT COUNT(category)
FROM pet_supplies;

   count
0   1500

There are 1500 entries, same as for the entire table, meaning that the `category` column has no `null` values.

Let's see the unique values of the `category` column.

In [2]:
SELECT DISTINCT category
FROM pet_supplies;

    category
0   Medicine
1       Food
2  Equipment
3          -
4  Accessory
5    Housing
6       Toys

We'll replace the missing value, i.e. "-", with "Unknown". This is the query we'll use for that:

In [5]:
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category
FROM pet_supplies
LIMIT 5;

   product_id  category
0           1      Food
1           2   Housing
2           3      Food
3           4  Medicine
4           5   Housing

### The `animal` column
_**Criteria:** Nominal. The type of animal the product is for. One of Dog, Cat, Fish, Bird. Missing values should be replaced with “Unknown”._

Let's check if this column has any `null` values.

In [6]:
SELECT COUNT(animal)
FROM pet_supplies;

   count
0   1500

There are no `null` values. Let's see the unique `animal` values.

In [7]:
SELECT DISTINCT animal
FROM pet_supplies;

  animal
0   Fish
1    Cat
2   Bird
3    Dog

Everything looks fine, so adding to our query for `category`, we have:

In [8]:
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal
FROM pet_supplies
LIMIT 5;

   product_id  category animal
0           1      Food   Bird
1           2   Housing   Bird
2           3      Food    Dog
3           4  Medicine    Cat
4           5   Housing    Cat

### The `size` column
_**Criteria:** Ordinal. The size of animal the product is for. Small, Medium, Large. Missing values should be replaced with “Unknown”._

Let's see if this column has null values.

In [9]:
SELECT COUNT(size)
FROM pet_supplies;

   count
0   1500

There are no `null` values. Let's see the unique values.

In [10]:
SELECT DISTINCT size
FROM pet_supplies;

     size
0   large
1  medium
2   Large
3  Medium
4   SMALL
5   small
6   LARGE
7  MEDIUM
8   Small

Ignoring the case, we see that there are 3 unique `size` values. We want each value to be in title case. We can achieve that using the `INITCAP()` function.

In [11]:
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal,
	CASE
		WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
		ELSE 'Unknown'
	END AS size
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size
0           1      Food   Bird   Large
1           2   Housing   Bird  Medium
2           3      Food    Dog  Medium
3           4  Medicine    Cat   Small
4           5   Housing    Cat   Small

### The `price` column
_**Criteria:** Continuous. The price the product is sold at. Can be any positive value, round to 2 decimal places. Missing values should be replaced with the overall median price._

Let's check if this column contains any null values.

In [1]:
SELECT COUNT(price)
FROM pet_supplies;

   count
0   1500

There are no null values. `price` is not supposed to be negative, so let's see if there are values less than 0.

In [ ]:
SELECT price
FROM pet_supplies
WHERE price < 0
LIMIT 5;

Error: SELECT price
FROM pet_supplies
WHERE price < 0
LIMIT 5; - operator does not exist: text < integer

Oh, it seems the data type of `price` is `text`, not `integer`. Let's confirm this.

In [3]:
SELECT DISTINCT pg_typeof(price)
FROM pet_supplies;

  pg_typeof
0      text

Indeed, the data type is `text`. We'll need to convert it to `numeric`.

Let's check if the pattern for this column resembles that of a positive whole or float number. Any entries that don't match this pattern will be replaced by the median of all values.

In [4]:
SELECT COUNT(price)
FROM pet_supplies
WHERE price SIMILAR TO '[0-9]*\.?[0-9]*';

   count
0   1350

We see that there are 150 `price` entries that doesn't match the above pattern. We'll replace these entries with the median of the other values. But before that, let's actually see what these non-matching entries look like.

In [5]:
SELECT DISTINCT price
FROM pet_supplies
WHERE price NOT SIMILAR TO '[0-9]*\.?[0-9]*';

      price
0  unlisted

We see that each of the 150 non-matching entries has a value of "unlisted". We'll replace this with the median of the other `price` values. To achieve this, we'll need to get the median using a common table expression (CTE). This is because we can't cast "unlisted" to `numeric` type.

In [12]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
)

-- main query with the CTE
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal,
	CASE
		WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
		ELSE 'Unknown'
	END AS size,
	CASE
		WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
		ELSE (SELECT * FROM median)
	END AS price
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size  price
0           1      Food   Bird   Large  51.10
1           2   Housing   Bird  Medium  35.98
2           3      Food    Dog  Medium  31.23
3           4  Medicine    Cat   Small  24.95
4           5   Housing    Cat   Small  26.18

### The `sales` column
_**Criteria:** Continuous. The value of all sales of the product in the last year. This can be any positive value, rounded to 2 decimal places. Missing values should be replaced with the overall median sales._

Let's check for null values.

In [13]:
SELECT COUNT(sales)
FROM pet_supplies;

   count
0   1500

There are no null values. Let's check for negative values.

In [14]:
SELECT sales
FROM pet_supplies
WHERE sales <= 0;

Empty DataFrame
Columns: [sales]
Index: []

It seems that all products sold at least once.

The current state of our overall query will now be:

In [15]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
)

-- main query with the CTE
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal,
	CASE
		WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
		ELSE 'Unknown'
	END AS size,
	CASE
		WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
		ELSE (SELECT * FROM median)
	END AS price,
	ROUND(sales::NUMERIC, 2) AS sales
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size  price    sales
0           1      Food   Bird   Large  51.10  1860.62
1           2   Housing   Bird  Medium  35.98   963.60
2           3      Food    Dog  Medium  31.23   898.30
3           4  Medicine    Cat   Small  24.95   982.15
4           5   Housing    Cat   Small  26.18   832.63

### The `rating` column
_**Criteria:** Discrete. Customer rating of the product from 1 to 10. Missing values should be replaced with 0._

Let's check if this has null values.

In [16]:
SELECT COUNT(rating)
FROM pet_supplies;

   count
0   1350

It has about 150 null values. Let's see all the unique values.

In [17]:
SELECT DISTINCT rating
FROM pet_supplies;

   rating
0     8.0
1     9.0
2     NaN
3     7.0
4     1.0
5     5.0
6     2.0
7     4.0
8     6.0
9     3.0

Indeed, there are null values. Let's make sure of the data type of this column before writing our query to handle null values.

In [18]:
SELECT DISTINCT pg_typeof(rating)
FROM pet_supplies;

  pg_typeof
0   integer

Let's now update our main query to include the `rating` column.

In [21]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
)

-- main query with the CTE
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal,
	CASE
		WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
		ELSE 'Unknown'
	END AS size,
	CASE
		WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
		ELSE (SELECT * FROM median)
	END AS price,
	ROUND(sales::NUMERIC, 2) AS sales,
	CASE
		WHEN rating IS NULL THEN 0
		ELSE rating
	END AS rating
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size  price    sales  rating
0           1      Food   Bird   Large  51.10  1860.62       7
1           2   Housing   Bird  Medium  35.98   963.60       6
2           3      Food    Dog  Medium  31.23   898.30       5
3           4  Medicine    Cat   Small  24.95   982.15       6
4           5   Housing    Cat   Small  26.18   832.63       7

### The `repeat_purchase` column
_**Criteria:** Nominal. Whether customers repeatedly buy the product (1) or not (0). Missing values should be removed._

Let's see if this column has null values.

In [22]:
SELECT COUNT(repeat_purchase)
FROM pet_supplies;

   count
0   1500

There are no null values. Let's see all the unique values.

In [23]:
SELECT DISTINCT repeat_purchase
FROM pet_supplies;

   repeat_purchase
0                0
1                1

Everything looks good. Let's add this column to our query.

In [24]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
)

-- main query with the CTE
SELECT product_id,
	CASE
		WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
			THEN category
		ELSE 'Unknown'
	END AS category,
	animal,
	CASE
		WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
		ELSE 'Unknown'
	END AS size,
	CASE
		WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
		ELSE (SELECT * FROM median)
	END AS price,
	ROUND(sales::NUMERIC, 2) AS sales,
	CASE
		WHEN rating IS NULL THEN 0
		ELSE rating
	END AS rating,
	repeat_purchase
FROM pet_supplies
LIMIT 5;

   product_id  category animal    size  price    sales  rating  repeat_purchase
0           1      Food   Bird   Large  51.10  1860.62       7                1
1           2   Housing   Bird  Medium  35.98   963.60       6                0
2           3      Food    Dog  Medium  31.23   898.30       5                1
3           4  Medicine    Cat   Small  24.95   982.15       6                1
4           5   Housing    Cat   Small  26.18   832.63       7                1

## Are Sales Higher for Repeat Purchases for Different Animals?
Now, we'll use our clean data from the previous section to answer the above question. To answer this question, we need to find the average sales (`avg_sales`) for each combination of `animal` and `repeat_purchase` indicator. To put the average sales in perspective, we'll find the range of sales too, i.e. the minimum (`min_sales`) and maximum sales (`max_sales`). Further, to make comparison in and between groups easy, we'll order by `animal` and then by `repeat_purchase`.

In [28]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
), clean_pet_supplies AS (
	SELECT product_id,
		CASE
			WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
				THEN category
			ELSE 'Unknown'
		END AS category,
		animal,
		CASE
			WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
			ELSE 'Unknown'
		END AS size,
		CASE
			WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
			ELSE (SELECT * FROM median)
		END AS price,
		ROUND(sales::NUMERIC, 2) AS sales,
		CASE
			WHEN rating IS NULL THEN 0
			ELSE rating
		END AS rating,
		repeat_purchase
	FROM pet_supplies
)

-- Are Sales Higher for Repeat Purchases for Different Animals?
SELECT animal, repeat_purchase,
	ROUND(AVG(sales)) AS avg_sales,
	ROUND(MIN(sales)) AS min_sales, ROUND(max(sales)) AS max_sales
FROM clean_pet_supplies
GROUP BY repeat_purchase, animal
ORDER BY animal, repeat_purchase;

  animal  repeat_purchase  avg_sales  min_sales  max_sales
0   Bird                0       1380        858       2255
1   Bird                1       1408        853       2256
2    Cat                0       1035        512       1730
3    Cat                1        998        512       1724
4    Dog                0       1084        574       1795
5    Dog                1       1038        574       1797
6   Fish                0        705        288       1307
7   Fish                1        693        287       1301

## Which cat and dog products that are bought repeatedly are most popular?

Next year, the management team wants to focus efforts on the most popular pets (cats and dogs) for products that are bought repeatedly. To help with this, we define popular based on `sales` and `ranking`.

Let's write a query that returns the `product_id`, `sales` and `rating` for repeated products for cats and dogs.

In [30]:
-- median CTE
WITH median AS (
	SELECT ROUND(
			(
				PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY price::NUMERIC)
			)::NUMERIC,
		2
	)
	FROM pet_supplies
	WHERE price SIMILAR TO '[0-9]*\.?[0-9]*'
), clean_pet_supplies AS (
	SELECT product_id,
		CASE
			WHEN category IN ('Housing', 'Food', 'Toys', 'Equipment', 'Medicine', 'Accessory')
				THEN category
			ELSE 'Unknown'
		END AS category,
		animal,
		CASE
			WHEN INITCAP(size) IN ('Small', 'Medium', 'Large') THEN INITCAP(size)
			ELSE 'Unknown'
		END AS size,
		CASE
			WHEN price SIMILAR TO '[0-9]*\.?[0-9]*' THEN ROUND(price::NUMERIC, 2)
			ELSE (SELECT * FROM median)
		END AS price,
		ROUND(sales::NUMERIC, 2) AS sales,
		CASE
			WHEN rating IS NULL THEN 0
			ELSE rating
		END AS rating,
		repeat_purchase
	FROM pet_supplies
)

-- Which cat and dog products that are bought repeatedly are most popular?
SELECT animal, product_id, sales, rating
FROM clean_pet_supplies
WHERE animal in ('Cat', 'Dog') AND repeat_purchase = 1
ORDER BY sales DESC, rating DESC
LIMIT 10;

  animal  product_id    sales  rating
0    Dog         518  1797.02       7
1    Dog         280  1795.77       5
2    Dog         728  1793.71       6
3    Dog          20  1792.63       7
4    Dog         946  1788.28       8
5    Cat         863  1724.15       7
6    Cat        1383  1723.87       8
7    Dog         272  1470.65       6
8    Dog         561  1469.55       5
9    Dog         285  1467.21       4

It seems that more dog products are popular, and that the most popular products have a rating of at least 4.